// Отправка писем в службу технической поддержки
Перем МассивОшибокНеПодлежащихОтправке;


#Если Не ВебКлиент И Не МобильныйКлиент Тогда
Процедура ОбработкаОтображенияОшибки(ИнформацияОбОшибке, ТребуетсяЗавершениеСеанса, СтандартнаяОбработка)
	
	// Отправка писем в службу технической поддержки	
	КатегорияВозникшейОшибки = ОбработкаОшибок.КатегорияОшибкиДляПользователя(ИнформацияОбОшибке);
	
	ИндексОшибки = МассивОшибокНеПодлежащихОтправке.Найти(КатегорияВозникшейОшибки);
	Если ИндексОшибки = Неопределено Тогда
	    СтандартнаяОбработка = Ложь;
		ОбработкаОшибокКлиент.ОбработкаОшибок(ИнформацияОбОшибке);
	КонецЕсли;

КонецПроцедуры
#КонецЕсли



// Отправка писем в службу технической поддержки
МассивОшибокНеПодлежащихОтправке = Новый Массив;
МассивОшибокНеПодлежащихОтправке.Добавить(КатегорияОшибки.ИсключениеВызванноеИзВстроенногоЯзыка);
МассивОшибокНеПодлежащихОтправке.Добавить(КатегорияОшибки.ОшибкаХранимыхДанных);
